facebook-creator-platform/test/load/smoke.yml
config:
  # Default: local Docker stack. Override for staging/prod:
  #   artillery run --target https://staging.example.com test/load/smoke.yml
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 2
      name: "smoke"
  plugins:
    # expect plugin must be declared here — without it, all `expect:` blocks
    # inside requests are silently ignored (they are not built-in syntax).
    expect:
      outputFormat: prettyError
      reportFailuresAsErrors: true
    metrics-by-endpoint:
      useOnlyRequestNames: true
  ensure:
    p99: 300
    maxErrorRate: 1
  defaults:
    headers:
      authorization: "Bearer {{ $processEnvironment.TEST_JWT }}"
      content-type: "application/json"

# Fast (<30 s) smoke test — gate every PR / deployment.
# Asserts the core read paths return 2xx under trivial load.
#
# Run:
#   pnpm load:smoke
# or:
#   API_URL=http://localhost:3000 TEST_JWT=<token> artillery run test/load/smoke.yml
#
# Required env:
#   API_URL  — e.g. http://localhost:3000
#   TEST_JWT — a valid Clerk JWT for a seeded test user
#
# NFR:  p99 < 300 ms (read paths), error rate < 1 %

scenarios:
  - name: "health + core reads"
    flow:
      # Global prefix is api/v1 (main.ts: app.setGlobalPrefix('api/v1'))
      - get:
          name: "GET /health"
          url: "/api/v1/health"
          expect:
            - statusCode: 200
            - hasProperty: "status"

      - get:
          name: "GET /auth/me"
          url: "/api/v1/auth/me"
          # Requires TEST_JWT to be set; 401 here means the env is misconfigured
          expect:
            - statusCode: 200

      - get:
          name: "GET /workspaces"
          url: "/api/v1/workspaces"
          expect:
            - statusCode: [200, 401]